title: Embedded Event Manager
status: experimental
description: Identify creating of Embedded Event Manager Applets
references:
    - https://www.cisco.com/c/en/us/products/ios-nx-os-software/ios-embedded-event-manager-eem/index.html
author: Robert Wilson
date: 2019/11/16
tags:
    - attack.persistence
    - attack.defense_evasion
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'event manager applet'
        - 'action'
    condition: keywords
falsepositives:
    - Applet creation should be fairly rare in most environments, the applet parameters set after the creation command should immediately indicate whether this is expected behavior.
level: high
